---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PartMaker
source: html/5f7e4cf3-2b33-4185-70e1-56a9fa95dc3f.htm
---
# PartMaker Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.